{
  "heading": "Maggie Bittarelli",
  "subheading": "What I'm up to",
  "whatIsNow": "(This is a now page, and if you have your own site, you should make one, too.)",
  "lastUpdated": "Updated December 12, 2024, from the Greater Boston Area, MA",
  "updates": [
    {
      "heading": "I'm reading tons of books with my toddler",
      "paragraphs": [
        "My kiddo has been interested in reading since he developed even a modicum of an attention span. We'll read short books over and over, and longer books (60, 70, 80 page picture books) from start to finish in one sitting.",
        "Favorites of the moment are 'Pete the Cat: Pete at the Beach', 'Bear Snores On', and Busytown books."
      ]
    },
    {
      "heading": "I'm doing a lot of cooking and baking",
      "paragraphs": [
        "Since our toddler started eating solids midway through 2023, I've been cooking/prepping his meals from scratch, trying to use as many whole foods and diverse flavors as possible. We eat as a family, and the goal has always been to cook one meal for everyone. Autumn and Winter always awaken this drive to create delicious, warming food for myself and the people around me (family, neighbors)."
      ]
    },
    {
      "heading": "I'm building and thinking",
      "paragraphs": [
        "In the past few weeks I've begun designing and building a website for a local business, as well as creating this site from scratch. I've also been putting the final touches on the annual 'advent calendar' that I redesign and revamp every year for my husband's amusement.",
        "Someday I hope to join forces with a team of developers as supportive, scrappy, intelligent, and empathetic as the last team I was on. To that end, I'm perusing job openings in this tough job-seekers market, practicing skills by creating, and studying things I may be interviewed on but have never had to use professionally (traditional data structures and algorithms)."
      ]
    },
    {
      "heading": "Sleep tight, garden",
      "paragraphs": [
        "Where I am, frostier times are imminent (although, Happy Halloween - it's going to be 80 degrees F today!). I enjoy putting my community garden plot to bed, prepping it to be productive next year. Compost and mulched leaves have been applied, and garlic has been planted. In our yard, getting ready for winter largely entails leaving things as they are - all sorts of beneficial birds and bugs depend on dead flower stalks and leaf cover to survive the winter and/or plant eggs in."
      ]
    }
  ]
}